Revit 2027 API
ParameterTypeId.IfcExportElementAs Property
 "Export to IFC As"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcExportElementAs { get; }
Public Shared ReadOnly Property IfcExportElementAs As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcExportElementAs {
	ForgeTypeId^ get ();
}
static member IfcExportElementAs : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace